docs/tracking/principles/DESIGN_PRINCIPLES.org
#+TITLE: Prologos Design Principles
#+AUTHOR: Prologos Project
#+DATE: 2026-02-22

* Core Values

Prologos is built on a small set of non-negotiable values that inform every
design decision. When principles conflict, this ordering reflects priority.

For how these values are applied in practice through our research, design,
and implementation process, see [[file:DESIGN_METHODOLOGY.org][DESIGN_METHODOLOGY.org]].

** Correctness Through Types
The type system is the primary mechanism for ensuring program correctness.
Dependent types, linear types, and session types are not academic curiosities
--- they are practical tools for eliminating entire classes of bugs at compile
time. A well-typed Prologos program makes illegal states unrepresentable.

** Simplicity of Foundation
The language rests on a minimal, uniform foundation: homoiconic terms with
prefix notation. Every syntactic form --- types, expressions, sessions,
processes --- shares a single AST representation. Complexity is built through
composition, not special cases. The grammar should fit on one page.

** Progressive Disclosure
A user should be productive on day one with simple functional programming. The
full power of dependent types, session types, linear types, and logic
programming reveals itself gradually as understanding deepens. No feature is
mandatory. The same codebase can be read at multiple depths by collaborators
with different expertise.

** Pragmatism with Rigor
Deep theory hides behind an approachable surface. The Curry-Howard
correspondence, lattice-theoretic constraint propagation, and pi-calculus
foundations are there --- but users interact with ~spec~, ~defn~, ~session~,
and ~defproc~, not Greek letters. Proofs are constructed automatically by
proof search when possible.

* Decomplection

/Decomplect/: to unbraid, unweave --- to separate things that are
incidentally coupled. This is a central design philosophy borrowed from
Clojure's Rich Hickey, applied at every level of the language.

** Collections and Backends
Collection abstractions (Seqable, Buildable, Foldable, Indexed, Keyed,
Setlike) are decoupled from their concrete backends (RRB-Tree, CHAMP, thunked
cons). Users program against traits; implementations are swappable with zero
code changes. Adding a new backend (e.g., B+ tree for sorted maps) requires
only implementing the trait interface.

** Schema / Defn and Trait Bundles
Data shape (~schema~) is decoupled from behavior (~defn~ / ~impl~). Trait
bundles (~bundle Numeric := (Add, Sub, Mul, Neg, Abs, FromInt)~) decomplect
trait inheritance --- bundles are conjunctive (AND), not implicative (IMPLIES).
This avoids the diamond problem and superclass brittleness of Haskell/Rust.

** No Trait Hierarchies --- Bundles Only
Prologos does not support trait hierarchies, supertraits, or trait inheritance.
This is a non-negotiable design principle, not a missing feature.

The entire rationale for the ~bundle~ concept is to replace hierarchical
inheritance with flat, conjunctive composition:

- ~bundle Num := (Numeric, Comparable)~ is pure sugar, expanded at parse time
  into a flat conjunction: ~(Add A) (Sub A) ... (Eq A) (Ord A)~
- No trait /implies/ another trait. No trait /requires/ another trait as a
  precondition. Each trait is independent.
- ~:include~ on a trait refers only to bundled traits as conjunctive refinement
  with set semantics (de-duplication). It does NOT establish a hierarchy.

Why this matters:
1. *No diamond problem*: There is no lattice of traits to navigate
2. *No superclass brittleness*: Adding/removing a trait from a bundle never
   breaks downstream code --- it only changes the expansion
3. *Closed under composition*: Bundles compose bundles, all the way down
4. *Simple mental model*: A bundle IS a set of traits. ~:include~ is set union.
   There is no inheritance graph to reason about.

Concretely, the following is *illegal* in Prologos:
#+begin_src prologos
;; WRONG: This implies BoundedLattice inherits from Lattice
trait BoundedLattice {A : Type}
  :includes (Lattice A)     ;; NO --- traits do not include other traits
  top : A

;; RIGHT: Use a bundle for composition
bundle BoundedLattice := (Lattice, HasTop)

trait HasTop {A : Type}
  top : A
#+end_src

The ~:include~ keyword on ~trait~ is reserved for future bundled-trait
syntax (conjunctive refinement), never for hierarchical inheritance.

** Session / Defproc for Protocol Types
Protocol specification (~session~) is decoupled from process implementation
(~defproc~). A session describes /what/ communication happens; a defproc
describes /how/ one endpoint behaves. This mirrors the spec/defn duality:
session is to defproc what spec is to defn.

Because session types are first-class types, named session types compose
naturally: a continuation position can reference any named session type,
enabling complex protocols to be assembled from simpler building blocks. The
process (~defproc~) sees a single session type regardless of whether the
protocol was composed from multiple named types or defined monolithically.
See [[file:PROTOCOLS_AS_TYPES.org][Protocols as Types]].

** Data vs. Control
Types and expressions (tree-structured data) use brackets: ~[f x y]~.
Processes (linear control flow) use indentation. This syntactic distinction
reflects a genuine semantic boundary: computing values vs. sequencing actions.

** Compile-Time vs. Runtime
QTT multiplicities (~:0~, ~:1~, ~:w~) explicitly separate type-level
reasoning (erased at runtime) from value-level computation. Proofs are
first-class at type-check time but vanish from the compiled output.

* Layered Architecture

The language is designed as composable layers, each independently useful:

| Layer | Feature | Keyword | Dual |
|-------+-----------+----------+--------|
| 1 | Functions | ~defn~ | ~fn~ |
| 2 | Relations | ~defr~ | ~rel~ |
| 3 | Types | ~spec~ | ~:~ |
| 4 | Data | ~schema~ | ~{}~ |
| 5 | Protocols | ~session~ | ~dual~ |
| 6 | Processes | ~defproc~ | ~proc~ |
| 7 | Bundles | ~bundle~ | -- |

Each layer adds capability without invalidating the layers below. A program
using only layers 1-3 is a standard typed functional program. Adding layer 4
gives data modeling. Layer 5-6 adds concurrent protocol verification. Layer 7
composes trait constraints. Users choose their depth.

Note that Layer 5 (Protocols) supports *composition through the type system*:
named session types can appear in continuation positions, enabling complex
protocols to be assembled from simpler phases. This is not a separate
mechanism --- it falls out of session types being first-class types. See
[[file:PROTOCOLS_AS_TYPES.org][Protocols as Types]].

